src/Documents/СписаниеТоваров/СписаниеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
	<name>СписаниеТоваров</name>
	<basedOn>Document.ИнвентаризацияТоваров</basedOn>
	<registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
	<attributes>
		<name>Склад</name>
		<type>
			<types>CatalogRef.Склады</types>
		</type>
	</attributes>
	<attributes>
		<name>Комментарий</name>
		<type>
			<types>String</types>
		</type>
	</attributes>
	<attributes>
		<name>Ответственный</name>
		<type>
			<types>CatalogRef.Пользователи</types>
		</type>
	</attributes>
	<attributes>
		<name>ВидОперации</name>
		<type>
			<types>EnumRef.ВидыОперацийРасход</types>
		</type>
	</attributes>
	<tabularSections>
		<name>Товары</name>
		<attributes>
			<name>Номенклатура</name>
			<type>
				<types>CatalogRef.Номенклатура</types>
			</type>
		</attributes>
		<attributes>
			<name>ЕдИзм</name>
			<type>
				<types>CatalogRef.ЕдиницыИзмерения</types>
			</type>
		</attributes>
		<attributes>
			<name>Количество</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>10</precision>
					<scale>2</scale>
				</numberQualifiers>
			</type>
		</attributes>
	</tabularSections>
</mdclass:Document>

src/Documents/СписаниеТоваров/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.СписаниеТоваров.ПолучитьМакет("Печать");
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	СписаниеТоваров.Дата,
	|	СписаниеТоваров.Номер,
	|	СписаниеТоваров.Товары.(
	|		НомерСтроки,
	|		Номенклатура,
	|		ЕдИзм,
	|		Количество
	|	)
	|ИЗ
	|	Документ.СписаниеТоваров КАК СписаниеТоваров
	|ГДЕ
	|	СписаниеТоваров.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ДеньДата = Лев(Выборка.Дата, 10);
		ОбластьЗаголовок.Параметры.Номер = Выборка.номер;
		ОбластьЗаголовок.Параметры.ДеньДата = ДеньДата;
		
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
